#tax
ic=eval(input('input your 全年所得:'))
nic=ic-350000 #扣除免稅

if nic<=0:
    ave=ic/12
    print('本年不需繳稅')
    print(f'月平均可支配所得:{ave:.2f}')

else:
    if nic<=590000:
      tax=nic*0.05
    elif nic>590000 and nic<=1330000:
      tax=590000*0.05+(nic-590000)*0.12
    elif nic>1330000 and nic<=2660000:
      tax=590000*0.05+(1330000-590000)*0.12+(nic-1330000)*0.2
    elif nic>2660000 and nic<=4980000:
      tax=590000*0.05+(1330000-590000)*0.12+(2660000-1330000)*0.2+(nic-2660000)*0.3
    else:
       tax=590000*0.05+(1330000-590000)*0.12+(2660000-1330000)*0.2+(4980000-2660000)*0.3+(nic-4980000)*0.4
    ave=(ic-tax)/12
    print('今年所需繳的稅:',tax)
    print(f'月平均可支配所得:{ave:.2f}')
